{
  "doc_key": "pm-2025-08-duplicate-fulfillment",
  "title": "Postmortem PM-2025-08: Stripe Webhook Retries Triggered Duplicate Fulfillment",
  "doc_type": "postmortem",
  "created_at": "2025-08-10",
  "content": "# Postmortem PM-2025-08: Stripe Webhook Retries Triggered Duplicate Fulfillment\n\n## Summary\nOn 2025-08-09, a brief period of payment-gateway instability caused Stripe to retry webhook deliveries. Our webhook processor handled the duplicate Stripe events correctly (idempotent by `event_id`), but a downstream internal consumer (`fulfillment-dispatcher`) was not idempotent on our own event stream. As a result, ~183 orders were dispatched to fulfillment twice.\n\nCustomers were not double-charged, but warehouse operations created duplicate shipment labels for some orders. We caught the issue quickly and canceled duplicates before most left the warehouse.\n\n## Impact\n- Time window: 2025-08-09 16:22–16:41 UTC (19 minutes)\n- Affected orders: 183 with duplicate dispatch events\n- Downstream effects:\n  - 61 duplicate shipping labels created\n  - 9 packages physically prepared twice (stopped before pickup)\n- Customer impact:\n  - No double charges\n  - Some customers saw confusing “two shipments” notifications\n\n## Detection\n- Alert: `FulfillmentDuplicateDispatchSpike` (custom alert in **Fulfillment / Dispatcher** folder)\n- Support tickets: “Two tracking numbers for one order”\n- payment-gateway alert: elevated 5xx at `/webhooks/stripe` and increasing `stripe_webhook_queue_depth`\n\n## Timeline (UTC)\n- 16:22: payment-gateway pods begin restarting due to OOMKilled (root cause below).\n- 16:24: Stripe observes 5xx and retries `payment_intent.succeeded` events.\n- 16:26: payment-gateway recovers; webhook ingestion resumes.\n- 16:28: checkout-service sees payments succeed and emits internal `order.paid` events.\n- 16:31: fulfillment-dispatcher dispatches orders; duplicates start appearing.\n- 16:34: Alert fires; oncall investigates and pauses fulfillment-dispatcher.\n- 16:37: Dedupe script run to cancel duplicate dispatches and labels.\n- 16:41: Incident stabilized; dispatcher resumed with temporary guard.\n\n## Root cause\nTwo issues combined:\n1. payment-gateway pods restarted due to memory spike when logging full Stripe webhook payloads at INFO level (a debugging flag left enabled during an earlier incident). When pods were down, Stripe retries built up.\n2. fulfillment-dispatcher subscribed to internal topic `orders.paid` and used `order_id` as a message payload, but it did not enforce idempotency. When checkout-service processed “paid” transition twice for the same order (due to a race during recovery), it emitted `orders.paid` twice.\n\nImportant nuance: Stripe duplicate webhooks alone should not have caused duplicate `orders.paid`. The immediate duplication happened because our own processor re-applied a transition in one edge case:\n- one worker processed the event and updated payment to `SUCCEEDED`\n- another worker retried after a transient DB timeout and, due to a missing unique constraint on `(order_id, transition)`, emitted `orders.paid` again even though payment state was already `SUCCEEDED`\n\nSo we had idempotency at Stripe event ingestion, but not across internal derived events.\n\n## Contributing factors\n- Logging configuration: `LOG_WEBHOOK_PAYLOADS=true` increased memory usage and GC pressure in Node, contributing to OOMKilled.\n- Missing DB constraint: no unique constraint preventing duplicate insertion into `order_transitions` table.\n- Downstream consumer assumption: fulfillment-dispatcher assumed “upstream events are exactly-once”, which is not true in our system.\n- Lack of replay tooling: we had to improvise dedupe scripts quickly.\n\n## Resolution\nImmediate:\n- Scaled fulfillment-dispatcher to 0 to stop further dispatch.\n- Canceled duplicate shipping labels via internal warehouse API (manual script).\n- Patched checkout-service to emit `orders.paid` only when a DB update changes payment_status from non-succeeded to succeeded.\n\nStabilization:\n- Disabled webhook payload logging and redeployed payment-gateway.\n- Reduced webhook concurrency temporarily to reduce DB timeouts.\n\n## Corrective actions\n1. Add unique constraint:\n```sql\nalter table order_transitions\n  add constraint order_transition_unique unique (order_id, transition_name);\n```\n2. Make fulfillment-dispatcher idempotent:\n- Store `dispatch_id` and ensure `(order_id)` unique.\n- If a duplicate arrives, log and ack without action.\n3. Add alert: payment-gateway memory usage and OOMKilled count.\n4. Update Stripe webhook runbook with explicit warning about payload logging and downstream idempotency.\n5. Add a “replay-safe” design guideline to engineering handbook: all consumers must assume at-least-once delivery.\n\n## What went well\n- We had visibility into duplicate dispatch quickly.\n- Pausing a downstream consumer was straightforward and limited blast radius.\n- No double charges occurred because Stripe ingestion was idempotent.\n\n## What went poorly\n- Our internal event stream did not follow consistent idempotency conventions.\n- Debug flags were not clearly separated from production-safe settings.\n\n## References\n- ADR-2024-12 Stripe webhooks as source of truth\n- RB-2026-01 Stripe webhook backlog\n- Onboarding: Payments flow",
  "language": "en"
}