{
  "doc_key": "pm-2025-07-schema-drift",
  "title": "Postmortem PM-2025-07: Checkout Deploy Caused DB Schema Drift",
  "doc_type": "postmortem",
  "created_at": "2025-07-19",
  "content": "# Postmortem PM-2025-07: Checkout Deploy Caused DB Schema Drift and 500s\n\n## Summary\nOn 2025-07-18 we deployed checkout-service v2.9.0 to production. The service expected a new column (`orders.applied_promotions`) introduced by an Alembic migration, but the migration job failed silently in the promote workflow. As a result, new pods started returning 500s with `psycopg.errors.UndefinedColumn`.\n\nThis incident illustrates why “migrations are part of the deploy” and why the promote pipeline must fail closed when migrations do not run.\n\n## Impact\n- Time window: 2025-07-18 14:03–14:24 UTC (21 minutes)\n- Affected endpoints:\n  - `POST /api/checkout/start` returned 500 for ~68% of requests\n  - `GET /api/checkout/orders/{id}` returned 500 for orders created during the window\n- User impact:\n  - checkout conversion drop; many customers retried and eventually succeeded after rollback\n\n## Detection\n- Alert: `Checkout5xxSpike` fired at 14:05 UTC\n- Logs: repeated errors:\n  - `psycopg.errors.UndefinedColumn: column orders.applied_promotions does not exist`\n- Grafana: checkout-service error budget burn exceeded threshold\n\n## Timeline (UTC)\n- 14:03: promote workflow completed; new pods begin rollout.\n- 14:05: 5xx alert fired.\n- 14:07: Oncall inspects logs and identifies missing DB column.\n- 14:10: Rollback initiated to v2.8.3.\n- 14:14: Rollback complete; error rate drops.\n- 14:18: Migration job manually run (to prepare for later redeploy).\n- 14:24: Incident resolved; postmortem initiated.\n\n## Root cause\nThe promote workflow step intended to run Alembic migrations used the **application DATABASE_URL**, which points to PgBouncer. PgBouncer is in transaction pooling mode (ADR-2024-08). The migration job attempted to run a migration that used advisory locks and expected session-level behavior. Under PgBouncer transaction pooling, the lock acquisition was not stable and the job exited with a non-zero status.\n\nThe workflow did not mark the pipeline as failed because:\n- the migration step was marked `continue-on-error: true` to avoid “blocking releases for transient DB issues” (bad decision)\n- there was no explicit check that alembic head was applied\n\nSo the deploy proceeded with code expecting the new column, causing runtime errors.\n\n## Contributing factors\n- CI vs prod drift: migrations succeeded in staging because staging used direct Postgres endpoint for migrations.\n- Insufficient safeguards: no automated “schema compatibility check” between code and DB.\n- Lack of visibility: migration job logs were not surfaced in the promote summary; oncall had to dig in the cluster.\n\n## Resolution\n- Immediate rollback to restore service.\n- Manually ran migration job against Postgres primary (bypassing PgBouncer) using a Kubernetes Job:\n```bash\nkubectl -n ecommerce-prod create job --from=cronjob/checkout-migrations checkout-migrations-manual\nkubectl -n ecommerce-prod logs job/checkout-migrations-manual\n```\n- Confirmed schema applied:\n```sql\nselect column_name from information_schema.columns\nwhere table_name='orders' and column_name='applied_promotions';\n```\n\n## What went well\n- Rollback was fast and reliable.\n- Error was deterministic and easy to diagnose from logs.\n\n## What went poorly\n- The deploy pipeline hid migration failures.\n- We relied on PgBouncer URL for migrations, contradicting ADR-2024-08 guidance.\n- No canary or preflight test caught schema incompatibility.\n\n## Action items\n1. Remove `continue-on-error` from migration step in promote workflow.\n2. Add explicit gate: `alembic current == head` before deploying new pods.\n3. Ensure migrations use `DATABASE_URL_PRIMARY` (direct Postgres) in all environments.\n4. Add a lightweight “schema check” startup probe for checkout-service:\n   - on startup, query required columns and fail fast in staging (not prod) to catch drift.\n5. Update onboarding CI/CD doc to emphasize migration endpoint difference.\n\n## Related docs\n- ADR-2024-08 PgBouncer transaction pooling\n- RB-2025-06 Kubernetes rollout stuck (schema drift often looks like CrashLoopBackOff)\n\n## Lessons learned (nuanced)\n- Some migrations are “safe” under transaction pooling, but any migration that depends on session state (temp tables, session variables, advisory locks held across statements) is not. The cost of debugging intermittent migration failures is higher than the cost of running migrations against the primary directly.\n- “Fail open” pipelines feel convenient until they ship an incompatible binary. For schema-bound services like checkout, a blocked deploy is preferable to a live outage.\n\nWe will treat migrations as a first-class release artifact and include their logs in the promote summary so oncall can see failures immediately.",
  "language": "en"
}